// Free-form like sample (fallback detection)
if Cond1;
  // some code
elseif Cond2;
  // more code
else;
  // else code
endif;

do;
  // loop body
enddo;

for i = 1 to 5;
  // body
endfor;
